
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_connection_string
  * module.frontend.azurerm_resource_group.rg
* Delete
  * module.redis-cache.azurerm_private_endpoint.this[0]
* Replace
  * module.frontend.null_resource.azcli_exec[0]
  * module.redis-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
        id             = "https://div-aat.vault.azure.net/secrets/da-redis-connection-string/dcc5c560b2c740b984b9a455427d9615"
        key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
        name           = "da-redis-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        version        = "dcc5c560b2c740b984b9a455427d9615"
        versionless_id = "https://div-aat.vault.azure.net/secrets/da-redis-connection-string"

        timeouts {}
    }

  # module.frontend.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-da-aat"
        location = "uksouth"
        name     = "div-da-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-06-20T13:01:20Z"
          - "managedBy"           = "Divorce"
        } -> (known after apply)
    }

  # module.frontend.null_resource.azcli_exec[0] must be replaced
-/+ resource "null_resource" "azcli_exec" {
      ~ id       = "1579207594351422821" -> (known after apply)
      ~ triggers = {
          ~ "force_run" = "2023-06-20T13:01:12Z" -> (known after apply)
        }
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] will be destroyed
  - resource "azurerm_private_endpoint" "this" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/div-redis-aat" -> null
      - location                 = "uksouth" -> null
      - name                     = "div-redis-aat" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Network/networkInterfaces/div-redis-aat.nic.3b568db7-1dd8-44b7-b6e4-8e3be9299b65"
              - name = "div-redis-aat.nic.3b568db7-1dd8-44b7-b6e4-8e3be9299b65"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/div-redis-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "div-redis-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.9",
                        ]
                      - name         = "div-redis-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "div-redis-cache-aat" -> null
      - subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat" -> null
      - tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "managedBy"           = "Divorce"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/div-redis-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> null
          - name                 = "redis-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "div-redis-aat" -> null
          - private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat" -> null
          - private_ip_address             = "10.96.136.9" -> null
          - subresource_names              = [
              - "redisCache",
            ] -> null
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
        capacity                      = 1
        enable_non_ssl_port           = false
        family                        = "P"
      ~ hostname                      = "div-redis-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat" -> (known after apply)
        location                      = "uksouth"
        minimum_tls_version           = "1.2"
        name                          = "div-redis-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ public_network_access_enabled = false -> true
      ~ redis_version                 = "6.0.14" -> "4"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
        resource_group_name           = "div-redis-cache-aat"
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
        sku_name                      = "Premium"
      ~ ssl_port                      = 6380 -> (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
            enable_authentication           = true
          ~ maxclients                      = 7500 -> (known after apply)
            maxfragmentationmemory_reserved = 642
            maxmemory_delta                 = 642
            maxmemory_policy                = "volatile-lru"
            maxmemory_reserved              = 642
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }
    }

Plan: 2 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":323,"Program":"tfcmt","SHA1":"","Vars":{}} -->